# Ваня и Петя поспорили, кто быстрее решит следующую задачу: 
# “Задана последовательность неотрицательных целых чисел. 
# Требуется определить значение наибольшего элемента последовательности, 
# которая завершается первым встретившимся нулем (число 0 не входит в последовательность)”. 
# Однако 2 друга оказались не такими смышлеными. 
# Никто из ребят не смог до конца сделать это задание. 
# Они решили так: у кого будет меньше ошибок в коде, тот и выиграл спор. 
# За помощью товарищи обратились к Вам, студентам.


#Ваня - 4 ошибки
n = int(input("Введите число: "))              
max_number = -1                                  #max_number = 1000  
while n > 0:                                     #while n != 0:
    if n > max_number:                           #if max_number > n:   
        max_number = n
    n = int(input("Введите число: "))            #должна быть в конце
print(max_number)

#Петя - 5 ошибок
n = int(input("Введите число: "))               
max_number = -1
while n > 0:                                     #while n < 0:
    if n > max_number:                           #if max_number < n: 
        max_number = n                           #n = max_number
    n = int(input("Введите число: "))            #должна быть в конце
print(max_number)                                #print(n)